tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Zsh
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "fasd"
brew "fzf"

# Basic
brew "bat"
brew "direnv"
brew "fx"
brew "jq"
brew "tree"
brew "wget"

# Git
brew "git"
brew "git-lfs"

# Node.js
brew "nvm"
brew "yarn", args: ["without-node"]

# Scala
brew "giter8"
brew "sbt"
brew "scala"

# Python
brew "pipenv"
brew "pyenv"
brew "python"

# Go
brew "go"
brew "gomplate"

# Kubernetes
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "kubernetes-helm"

# DB
brew "mysql-client"
cask "mysqlworkbench"

# Applications
cask "docker"
cask "dropbox"
cask "font-hack-nerd-font"
cask "iterm2"
cask "ngrok"
cask "telegram-desktop"
cask "visual-studio-code"

# from Mac Appstore
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Melon", id: 1236050766
mas "Microsoft Remote Desktop", id: 1295203466
mas "Owly", id: 882812218
mas "Quiver", id: 866773894
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Things", id: 904280696
mas "Xcode", id: 497799835
