tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Zsh
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "fasd"
brew "fzf"

# Basic
brew "bat"
brew "fx"
brew "jq"
brew "tree"
brew "wget"
brew "wrk"

# Git
brew "git"
brew "git-lfs"

# Node.js
brew "nodejs"

# Scala
brew "giter8"
brew "sbt"
brew "scala"

# Python
brew "pipenv"
brew "pyenv"
brew "python"

# Go
brew "go"
brew "gomplate"

# Kubernetes
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "helm"
tap "thecasualcoder/stable"
brew "thecasualcoder/stable/kube-fzf"

# DB
brew "mysql-client"
cask "mysqlworkbench"

# Applications
cask "1password"
cask "alfred"
cask "docker"
cask "dropbox"
cask "easy-move-plus-resize"
cask "firecamp"
cask "font-hack-nerd-font"
cask "goland"
cask "google-backup-and-sync"
cask "google-chrome"
cask "intellij-idea"
cask "iterm2"
cask "itsycal"
cask "keybase"
cask "keyboard-maestro"
cask "lens"
cask "mongodb-compass"
cask "ngrok"
cask "postman"
cask "pycharm"
cask "sourcetree"
cask "sublime-text"
cask "telegram-desktop"
cask "typora"
cask "visual-studio-code"
cask "vlc"

# from Mac Appstore
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Melon", id: 1236050766
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Owly", id: 882812218
mas "Quiver", id: 866773894
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Things", id: 904280696
mas "Xcode", id: 497799835
